nbd_fio_results/dev-nbd0_2023-07-17_17:16/seq_w_nbd0_1iodepth/2048.txt
write: (g=0): rw=write, bs=(R) 2048KiB-2048KiB, (W) 2048KiB-2048KiB, (T) 2048KiB-2048KiB, ioengine=libaio, iodepth=1
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

write: (groupid=0, jobs=1): err= 0: pid=13952: Mon Jul 17 17:19:29 2023
  write: IOPS=707, BW=1414MiB/s (1483MB/s)(27.6GiB/20002msec)
    slat (usec): min=79, max=2328, avg=797.44, stdev=165.57
    clat (usec): min=237, max=4103, avg=592.54, stdev=145.58
     lat (usec): min=1197, max=4726, avg=1412.05, stdev=99.22
    clat percentiles (usec):
     |  1.00th=[  359],  5.00th=[  420], 10.00th=[  453], 20.00th=[  490],
     | 30.00th=[  519], 40.00th=[  545], 50.00th=[  562], 60.00th=[  594],
     | 70.00th=[  619], 80.00th=[  668], 90.00th=[  775], 95.00th=[  889],
     | 99.00th=[ 1106], 99.50th=[ 1172], 99.90th=[ 1270], 99.95th=[ 1303],
     | 99.99th=[ 1483]
   bw (  MiB/s): min= 1392, max= 1436, per=100.00%, avg=1414.40, stdev=11.38, samples=40
   iops        : min=  696, max=  718, avg=707.20, stdev= 5.69, samples=40
  lat (usec)   : 250=0.02%, 500=23.68%, 750=64.93%, 1000=8.99%
  lat (msec)   : 2=2.38%, 10=0.01%
  cpu          : usr=2.79%, sys=5.83%, ctx=225635, majf=0, minf=522
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,14145,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1414MiB/s (1483MB/s), 1414MiB/s-1414MiB/s (1483MB/s-1483MB/s), io=27.6GiB (29.7GB), run=20002-20002msec

Disk stats (read/write):
  nbd0: ios=0/224996, merge=0/0, ticks=0/139430, in_queue=114871, util=91.98%