nbd_fio_results/dev-nbd0_2023-07-17_17:16/seq_w_nbd0_1iodepth/4096.txt
write: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=1
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

write: (groupid=0, jobs=1): err= 0: pid=14000: Mon Jul 17 17:19:49 2023
  write: IOPS=347, BW=1389MiB/s (1457MB/s)(27.1GiB/20001msec)
    slat (usec): min=142, max=2202, avg=1445.46, stdev=384.85
    clat (usec): min=520, max=5098, avg=1412.59, stdev=391.02
     lat (usec): min=2469, max=5972, avg=2877.18, stdev=132.93
    clat percentiles (usec):
     |  1.00th=[  938],  5.00th=[ 1037], 10.00th=[ 1090], 20.00th=[ 1139],
     | 30.00th=[ 1188], 40.00th=[ 1237], 50.00th=[ 1287], 60.00th=[ 1336],
     | 70.00th=[ 1418], 80.00th=[ 1565], 90.00th=[ 2040], 95.00th=[ 2343],
     | 99.00th=[ 2638], 99.50th=[ 2737], 99.90th=[ 2835], 99.95th=[ 2868],
     | 99.99th=[ 5080]
   bw (  MiB/s): min= 1336, max= 1416, per=99.99%, avg=1388.93, stdev=23.10, samples=40
   iops        : min=  334, max=  354, avg=347.22, stdev= 5.77, samples=40
  lat (usec)   : 750=0.09%, 1000=2.48%
  lat (msec)   : 2=86.48%, 4=10.94%, 10=0.01%
  cpu          : usr=2.81%, sys=4.59%, ctx=201460, majf=0, minf=522
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6946,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1389MiB/s (1457MB/s), 1389MiB/s-1389MiB/s (1457MB/s-1457MB/s), io=27.1GiB (29.1GB), run=20001-20001msec

Disk stats (read/write):
  nbd0: ios=0/220957, merge=0/0, ticks=0/267013, in_queue=242121, util=94.00%